Retrieve a forward moving iterator to the array.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public virtual VertexIndexPairArrayIterator ForwardIterator()
  Visual Basic
Public Overridable Function ForwardIterator As VertexIndexPairArrayIterator
  Visual C++
public:
virtual VertexIndexPairArrayIterator^ ForwardIterator()
 Return Value
 Returns a forward moving iterator to the array.
 See Also
  VertexIndexPairArray Class
  Autodesk.Revit.DB Namespace